# SlabShapeVertex Class

---
Represents a vertex of a slab shape edited element.
SystemObject Autodesk.Revit.DBSlabShapeVertex
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class SlabShapeVertex : IDisposable

    Public Class SlabShapeVertex
    	Implements IDisposable

    public ref class SlabShapeVertex : IDisposable

    type SlabShapeVertex =
        class
            interface IDisposable
        end
The SlabShapeVertex type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| Position|  The vertex position
| VertexType|  The vertex type
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the SlabShapeVertex
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace